src/digitalmodel/solvers/openfoam/templates/ship_resistance/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         @ENDTIME@;

deltaT          1;

writeControl    timeStep;

writeInterval   @WRITEINTERVAL@;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (hull);
        rho             rhoInf;
        rhoInf          @RHO@;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (@COFR@);
    }
}


// ************************************************************************* //
